# app.py 
import streamlit as st

st.set_page_config(
    page_title="หน้าภาพรวม",
    page_icon="👋",
)

st.title("ยินดีต้อนรับสู่ระบบจัดการหนี้สิน 👋")
st.sidebar.success("กรุณาเลือกเมนูด้านบนเพื่อเริ่มต้น")

st.markdown(
    """
    แอปพลิเคชันนี้ถูกสร้างขึ้นเพื่อจัดการข้อมูลสมาชิก, หนี้สิน, และการชำระเงิน
    **👈 กรุณาเลือกเมนูจากแถบด้านซ้าย** เพื่อเข้าถึงส่วนต่างๆ ของระบบ:
    - **หน้าหลัก:** สำหรับเพิ่มสมาชิก, ดูข้อมูล, และชำระเงิน
    - **แก้ไขหรือลบข้อมูล:** สำหรับจัดการข้อมูลสมาชิกที่มีอยู่
    - **เครื่องมือแอดมิน:** สำหรับคำนวณดอกเบี้ยประจำรอบ 2
    """
)
st.markdown("""พัฒนาโดย เอกพล แข็งแรง""")

